{
  "events" : [
    {
      "name": "Science Technology Entry Program (STEP) Classes - Spring 2018",
      "description": "This semester, coding&&community is offering two classes for STEP students. The first unit is HTML/CSS and Javascript. Students in this class are introduced to computer science and learn the basics of front-end web development. By the end of the Unit I course, each student will have compiled a portfolio of HTML/CSS projects, including a dynamic personal webpage, which they will host on Github pages. The second unit is more advanced Python and Javascript. Students focus more on programming logic and problem solving by working through small to medium projects. At the end, students will pick a final project, which can either be a Python program or a website that implements Javascript. With both groups, the instructors encourage students to try new things, ask for help when needed, and to help their peers. Transferable skills like presenting and public speaking, and typing are also a focus of this program.",
      "date": "Saturday mornings from January to May",
      "location": "Rensselaer Polytechnic Institute",
      "pictures": []
    },
    {
      "name": "Black Family Tech Awareness Day",
      "description": "We participated in this campus-wide event offered to local students and their parents to learn more about STEM. At our program, we gave a presentation about the amazing opportunities that computer science holds and why increasing diversity in this field is so important. We also hosted a short lesson introducing basic HTML and CSS. Participants, students and parents alike, made basic websites and were introduced to Github. Later in the day, participants were able to explore computer science through stations with more basic website development, Sonic Pi and CodeCombat.",
      "date": "Saturday, February 3, 2018",
      "location": "Rensselaer Polytechnic Institute",
      "pictures": ["assets/img/bftad_2018/bftad1_2018.jpg", "assets/img/bftad_2018/bftad3_2018.jpg", "assets/img/bftad_2018/bftad4_2018.jpg"]
    },
    {
      "name": "Exploring Computer Science at Exploring Engineering Day",
      "description": "We participated in this campus-wide event hosted by the Society of Women Engineers at RPI offered to local elementary school students to learn more about engineering. For our session, we started by talking about some of the interdisciplinary fields that computer science can apply to. Then for the main acitivity, the students learned basic Python through CodeCombat.",
      "date": "Saturday, February 10, 2018",
      "location": "Rensselaer Polytechnic Institute",
      "pictures": []
    },
    {
      "name": "STEP Regional Conference",
      "description": "We will host an interactive workshop with multiple stations to introduce STEP students across New York State to the possibilities of computer science. This program will be styled similarly to that of Black Family Tech Awareness Day. There will be a series of stations exploring basic web development in HTML and various coding games and software like Sonic Pi and CodeCombat.",
      "date": "Friday, March 23, 2018",
      "location": "the Albany Marriott",
      "pictures": []
    },
    {
      "name": "CCHacks",
      "description": "CCHacks is a hackathon for high school students to be hosted by coding&&community. Students from the Capital Region will be able to work in teams on a variety of projects that accommodate all skill levels, emphasizing creativity and teamwork. This event would be great for any student interested in STEM fields or the tech industry! We are currently looking for corporate sponsors. Contact Ethan Graf (grafe@rpi.edu) if you would like to work with us!",
      "date": "Saturday, April 21, 2018 ",
      "location": "Rensselaer Polytechnic Institute",
      "pictures": []
    },
    {
      "name": "Ten80 Kids Workshop",
      "description": "",
      "date": "Saturday, April 28, 2018 ",
      "location": "Rensselaer Polytechnic Institute",
      "pictures": []
    },
    {
      "name": "Science Technology Entry Program (STEP) Classes - Fall 2017",
      "description": "coding&&community started by teaching basic Python and HTML and CSS. Students made a few smaller Python programs like rock, paper, scissors and a guessing game, and they all made a personal website hosted on Github pages. At the end, each student could choose a final project which would either be Python program or another website. All of the students presented their final project at the last lesson in December to their families. We hosted two guest speakers. Dorcie Lovinsky, a former STEP student and current Creative Software Engineer at Adobe, video called in to talk about her experience, give the students advice, and answer questions. Chris McEvoy, formerly at Vicarious Visions and now Chief Software Engineer at Valen Studios came on site to talk about how to be a software engineer and answer questions about his experience in the field.",
      "date": "Saturday afternoons from September to December",
      "location": "Rensselaer Polytechnic Institute",
      "pictures": ["assets/img/step_fall2017/step1.jpg", "assets/img/step_fall2017/step2.jpg", "assets/img/step_fall2017/step3.jpg", "assets/img/step_fall2017/step4.jpg", "assets/img/step_fall2017/step5.jpg", "assets/img/step_fall2017/step6.jpg", "assets/img/step_fall2017/step7.jpg"]
    }
  ]
}